[{"id":206,"title":"Votre API n\u0027est pas RESTful","summary":"à moins que vous sachiez ce que signifie HATEOAS :-)","description":"5 minutes pour expliquer comment transformer une API HTTP en API RESTful, challenge accepté !","language":"fr","interests":[74,245,240,134,287,207],"speakers":[645],"nbVotes":64},{"id":208,"title":"CasperJS, a ghost in the shell","summary":"CasperJS permet de scripter et tester vos scénarios de navigation sur navigateur Web ne nécessitant pas d’interface graphique.","description":"[CasperJS](http://casperjs.org/) est un outil permettant de scripter en Javascript un scénario de navigation sur un véritable navigateur Web, basé sur Webkit et ne nécessitant pas d’interface graphique. CasperJS peut servir à produire des tests fonctionnels poussés bénéficiant d’un environnement DOM et Javascript complet, mais aussi à analyser des documents Web, faire des tests de performance ou même extraire des données.\r\n\r\nL’intérêt majeur de CasperJS est qu’il permet relativement simplement de tester et valider fonctionnellement des sites et applications Web complexes, reposant sur l’exploitation intensives de Javascript, de comportements asynchrones et d’AJAX par exemple.","interests":[5,336,334,335,285],"speakers":[651],"nbVotes":42},{"id":222,"title":"Unix as an IDE","summary":"Pourquoi s\u0027encombrer d\u0027un IDE quand on utilise Unix ?","description":"Les développeurs entretiennent une relation très particulière avec leurs outils, une relation souvent passionnelle. Pourtant, certains persistent à utiliser leur bon vieil éditeur de texte (Emacs, Vim, etc...) et les outils en ligne de commande Unix traditionnels. Nous allons voir comment Unix peut être considéré comme un IDE et mieux encore un **excellent** IDE !","language":"fr","interests":[183,195,65,351],"speakers":[152],"nbVotes":32},{"id":223,"title":"Staff : SOAP et REST en C++","summary":"Il n\u0027aura jamais été aussi simple de créer des services web pour des applications natives en C++!","description":"Staff est une bibliothèque permettant de développer rapidement des services et des clients SOAP ou REST en C++ sans avoir à entrer dans la tuyauterie et donc en se concentrant sur le code métier.\r\nNous verrons comment il est possible de créer des services web en moins de 5 minutes à partir d\u0027une simple fichier de description décrivant les services et un peu de magie russe :)","interests":[343,342,199,74,240,134,135,341,94],"speakers":[605],"nbVotes":7},{"id":224,"title":"Pourquoi passer en SaaS?","summary":"Probablement le lightning le moins technique ;)","description":"Quels bouleversements amènent le SaaS?\r\nPasser en SaaS, oui!\r\nMais pour quelles raisons?\r\nEt comment adapter son entreprise à ce nouveau moyen de distribution?","interests":[145,12,245,144,252,251,221,197],"speakers":[588],"nbVotes":24},{"id":237,"title":"Intro à Jenkins","summary":"Du dev au déploiement grâce à Jenkins","description":"Comment se simplifier la vie lors des développements grâce à Jenkins ? Comment lui déléguer un maximum de choses ? Nous verrons comment Jenkins peut vous aider à réduire la charge de travail côté dev et à automatiser tout un ensemble de tâches rébarbatives : bien entendu les tests, mais aussi les commits vers votre SCM préféré GIT, et pourquoi pas le déploiement de votre appli vers votre infra ou du cloud.","interests":[296,199,336,245,163,22,70,65,285,14],"speakers":[608],"nbVotes":30},{"id":239,"title":"Scrumiens scrumiennes : prenez garde !","summary":"Satisfaction du client : attention aux pièges des releases et de l\u0027amélioration continue de l\u0027équipe","description":"Le manager fait confiance à son équipe, soutient son auto-organisation, et lui donne les moyens de faire. L\u0027équipe fait de l\u0027itératif, et s\u0027améliore continuellement. Objectif atteint : le client est satisfait (1er principe agile).\r\n\r\nOui, mais... si on n\u0027y prend pas garde, le rythme des releases et l\u0027amélioration de l\u0027équipe peuvent représenter 2 sources d\u0027insatisfaction du client, ce qui peut engendrer un cercle vicieux : perte de confiance du manager, et frustration de l\u0027équipe.\r\n\r\nJe vous propose de voir comment cela peut arriver, et d\u0027énoncer quelques pistes possibles d\u0027amélioration.","interests":[27,353,17,18,26,44],"speakers":[13],"nbVotes":44},{"id":243,"title":"En finir avec les méthodes agiles","summary":"Depuis bien longtemps, j’avoue avoir une petite irritation lorsque j’entends parler de « méthodes agiles ». Je vais vous expliquer pourquoi.","description":"Depuis bien longtemps, j’avoue avoir une petite irritation lorsque j’entends parler de « méthodes agiles ». Je vais vous expliquer pourquoi.\r\nJe vous rassure tout de suite, mon intention n’est pas de dire que l’agilité ne sert à rien ! Bien au contraire, je reste, malgré ce titre peut-être un peu provocateur, un fervent supporter de l’adoption des principes qui guident l’agilité pour permettre d’atteindre le but ultime : produire de la valeur. \r\nNon, là n’est pas mon intention. Ce qui m’irrite, donc, c’est d’entendre ces deux mots si plein de sens ensemble : Comment peut-on parler de « méthode » lorsque l’on parle d’agilité ?\r\nIl faut dépasser le cadre des méthodes, et comprendre le sens des choses. Je terminerai par une ouverture vers un modèle de maturité appelé Agile Fluency.","language":"fr","interests":[27,419,366,367,364,365],"speakers":[306],"nbVotes":32},{"id":244,"title":"Open Space Software Development","summary":"J\u0027ai vécu une expérience extraordinaire, en tout cas pour moi. J\u0027aimerais vous faire un retour de tout ce que j\u0027y ai appris !","description":"Cet été, à Barcelone, j\u0027ai participé à ALE 2012, une non-conférence du réseau Agile Lean Europe. 3j extraordinaires durant lesquels j\u0027ai vécu une des expériences les plus enrichissantes qu\u0027il m\u0027ait été donné de vivre : un open space de développement. \r\nPendant 3j, nous avions pour objectif de développer une application et ainsi observer comment une équipe d\u0027agilistes convaincus qui ne se connaissaient pas était capable de se comporter en environnement réel. Je vais donc tenter de vous faire un retour sur cette incroyable expérimentation.\r\nQu\u0027avons-nous réussir à faire ? Où avons-nous échouer ? Quels ont été les enseignements de cette expérience ? Voilà tout ce que j\u0027aimerais partager avec vous !","interests":[183,27,29,296,369,368,17,3,70,31],"speakers":[306],"nbVotes":24},{"id":245,"title":"Pas d\u0027Agile sans Qualité","summary":"\"Si tu ne te préoccupes pas de la Qualité, la Qualité s\u0027occupera de toi !\". Et c\u0027est d\u0027autant plus vrai quand on veut être agile !","description":"L\u0027agile c\u0027est pas que des post-its au mur et des réunions debout, c\u0027est aussi la qualité. Il est même impossible d\u0027être réellement agile sans passer par la qualité. L\u0027Agile, c\u0027est la charrue, et la qualité c\u0027est les boeufs ! Et non pas l\u0027inverse !\r\nJe vous propose donc à travers ce LT de vous expliquer pourquoi il faut élever son niveau de qualité, avant de penser à une quelconque transition agile. Malheureusement, la plupart de ces transitions échouent justement par oubli de ce principe fondamental.","interests":[27,275,336,245,3,34],"speakers":[306],"nbVotes":27},{"id":269,"title":"Eclipse : effective configuration \u0026 plugins","summary":"Sharing my tips \u0026 tricks on Eclipse setup to have a better productivity","description":"Eclipse, eclipse...\r\n\r\nDo you really use the configuration provided by default in Eclipse IDE ?\r\nHow many times have you configured it as you wish ?\r\nHow much time have you spend configuring it ?\r\n\r\nIf you want to see how Eclipse should be configured to speedup your devs, discover some really useful plugins and learn some good advice on how to use Eclipse,\r\n\r\nVote for this lightning talk !","interests":[187,336,245,182,3,64,2,65,311,285,11],"speakers":[636],"nbVotes":20},{"id":306,"title":"Alors ? Simple ou Facile ?","summary":"Encore aujourd\u0027hui des équipes parlent de solutions simples et faciles à un problème. Pourtant facilité et simplicité ne sont pas synonymes.","description":"Encore aujourd\u0027hui j\u0027entends des équipes parler de solutions simples et faciles à un problème. Pourtant la facilité et la simplicité ne sont pas synonymes dans notre monde.\r\nCe que je souhaite montrer à travers ce Lightning talk, c\u0027est cette différence, à mon sens fondamentale, entre ces 2 notions.\r\n","interests":[410,407,409,408],"speakers":[306],"nbVotes":20},{"id":308,"title":"eXtreme testing avec Byteman","summary":"Un test impossible ? Byteman est votre héro !","description":"Comment faire pour tester les situations les plus extrêmes avec les frameworks de tests les plus courants ? Du code legacy ?\r\nDe la simulation d\u0027un disque plein à la simulation d\u0027un ralentissement d\u0027une liaison client-serveur, byteman est la solution la plus facile et efficace à mettre en place. Nous verrons à l\u0027aide d\u0027exemples concrets comment byteman peut aider le développeur au quotidien pour fournir des tests d\u0027intégrations/systèmes les plus simples et efficaces possible.","language":"fr","speakers":[82],"nbVotes":23},{"id":309,"title":"Vous reprendrez bien une Corona ?","summary":"Démo de Corona SDK , un SDK en lua pour des applis hybride Android/iOS","description":"Une brève présentation de ce que peux faire Corona SDK , outil avec lequel sont faites toutes les applications d\u0027Aetys http://www.aetys.fr !","language":"fr","speakers":[82],"nbVotes":12},{"id":310,"title":"FluentLenium","summary":"Selenium c\u0027est bien, FluentLenium c\u0027est mieux !","description":"Présentation des nouveautés de FluentLenium, wrapper autour de Selenium proposant une api Fluent et intuitive ainsi qu\u0027une meilleure gestion des appels asynchrones.","language":"fr","speakers":[82],"nbVotes":14},{"id":311,"title":"Comment faire de la veille ?","summary":"Présentation de méthodes et outils pour faire une bonne veille et plus rien rater","description":"- Présentation de quelques sites d\u0027actu de référence : Reddit, Hacker News\r\n- Quelques outils pour faciliter sa veille\r\n- Conseils pour ne rien rater tout en évitant la saturation d\u0027infos","language":"fr","interests":[182,158,61,409,238,191,41,45],"speakers":[546],"nbVotes":27},{"id":312,"title":"Golo : Il ne doit en rester qu\u0027un","summary":"Venez voir pourquoi vous n\u0027avez plus besoin de S**** \u0026 co (provocateur pour rire)","description":"\u003e pour ceux qui ne connaissent pas [Golo](http://golo-lang.org/), c\u0027est un langage qui tourne dans la JVM, qui a la particularité d\u0027être extrêmement léger, mais aussi extrêmement rapide. Il propose bien sûr une pleine interopérabilité avec Java. Et ce que vous faites en  [Golo](http://golo-lang.org/) est utilisable en Java.\r\n\r\n##Intro \r\n\r\n[Golo](http://golo-lang.org/) est tellement simple à apprendre, tellement facile à étendre, tellement mignon, tellement ... qu\u0027à quoi bon allez se prendre la tête sur des langages ésotériques et compliqués à assimiler, qui ne servent qu\u0027à se la jouer ;)\r\n\r\nOn avait prévu beaucoup plus long avec [@titimoby](https://twitter.com/titimoby), mais la direction a pensé que c\u0027était trop novateur :), j\u0027espère quand même vous donner l\u0027envie en 5 minutes.\r\n\r\n##Programme\r\n\r\nJ\u0027aborderais :\r\n\r\n- les closures : ceux qui ont pondu Java 8 devraient y jeter un coup d\u0027oeil\r\n- les DynamicObjects : oubliez les classes. Un paradigme objet proche du monde réel\r\n- les workers : les threads pour ta mère\r\n- Pimp ... pardon augment : éloignez les enfants du postes\r\n- Golo ❤ Java ❤ Golo\r\n- Et finalement à quoi ça sert ? ... Tu n\u0027as qu\u0027à venir pour le savoir\r\n\r\n*p... où est-ce que je vais encore me fourrer ...*\r\n\r\n##Quelques exemples\r\n\r\n###match \u0026 closure\r\n\r\n    module routes\r\n\r\n    #golo modules : controllers\r\n    import application\r\n    import mycontroller\r\n\r\n    #\u003d\u003d\u003d ROUTES \u003d\u003d\u003d\r\n    function action \u003d |route, httpConnection| -\u003e match {\r\n        when route: startsWith(\"POST:/infos\")      then mycontroller(): postInfos(httpConnection)\r\n        when route: equals(\"GET:/bigjson\")         then mycontroller(): giveMeBigJsonObject(httpConnection)\r\n        otherwise null\r\n    }\r\n\r\n###DynamicObjects\r\n\r\n\tlet sam \u003d DynamicObject():\r\n\t\tname(\"Sam\"):\r\n\t\tdefine(\"hello\", |this|-\u003e println(\"Hello from \"+this:name()))\r\n\r\n\tsam:hello()\r\n\r\n\tlet paul \u003d DynamicObject():mixin(sam):name(\"Paul\")\r\n\r\n\tpaul:hello()\r\n","language":"fr","interests":[180,429,430,427,281],"speakers":[23],"nbVotes":33},{"id":313,"title":"J//Académie : ce que le prof a appris","summary":"Après un an de cours d\u0027Enterprise Java aux étudiants, le bilan vu par le prof","description":"La J//Académie est un dispositif d\u0027enseignement des technologies Java d\u0027entreprise (Maven, EJB, JSF, Hibernate, Spring...) mis en place par SQLI au sein de deux écoles d\u0027ingénieurs partenaires, les Mines de St-Etienne et Telecom St-Etienne.\r\n\r\nEn plus de leur formation ingénieur informatique classique, les élèves ont pu compléter leur background technique par une spécialisation en Enterprise Java.\r\n\r\nAu final, non seulement les élèves étaient contents, mais ce module a en plus été source de pas mal d\u0027enseignements pour le prof.\r\n\r\nEn effet, en tant qu\u0027industriel, notre vision est conditionnée par l\u0027approche technologique et métier traditionnelle en SSII, chez les clients, et les éditeurs.\r\nNotre vision des technos est également conditionnée par les canaux classiques d\u0027innovation et de partage d\u0027innovation : confs, JUGs, twitter...\r\n\r\nLa vision fraîche et libre des étudiants - pas encore pervertis par le système :) - a été vraiment appréciable et je vous propose de partager ces retours à travers ce lightning talk, vu que le prof, c\u0027était moi !\r\n","language":"fr","interests":[36,7,54,64,2,130,11],"speakers":[75],"nbVotes":15},{"id":314,"title":"Peut on toujours être développeur après 40 ans","summary":"Est on dépassé quand on a plus de 40 ans et que l\u0027on continue à coder ?","description":"Vous avez commencé l\u0027informatique au siècle dernier ? Vous connaissez les langages comme COBOL ou RPG ? Vous savez développer sur des plateformes où les seuls terminaux ont 24 lignes et 80 colonnes ? Vous avez 40 ans, vous avez une vie de famille, vous êtes toujours développeur et vous aimez ça ? A travers mon parcours personnel, nous ferons le point sur cette population qui a vu naitre les technologies du web, s\u0027est adapté et approprié ces technologies pour en faire ce qu\u0027elles sont aujourd\u0027hui. Nous essaierons de répondre à des questions existentielles (ou pas). Comment s\u0027intégrer dans des équipes où la plupart des membres pourraient être vos enfants et qui n\u0027ont toujours connu que le Web ? Ai je raté ma vie si je ne suis pas chef de projet ? Que faire de tous ces nouveaux langages/outils dont on entend parler à la pause café ? Comment mettre à profit ma seniorité dans ce contexte ? Et surtout comment concilier ça avec une vie de famille sans passer pour un ado attardé par son entourage ?","language":"fr","interests":[259,196,191],"speakers":[48],"nbVotes":31},{"id":315,"title":"La webperf ce n\u0027est pas de la technique","summary":"Pourquoi faire qu\u0027un site Web se charge rapidement n\u0027est pas qu\u0027une affaire de technique","description":"La webperf ce n\u0027est pas *que* de la technique.\r\nBien sûr il existe des règles de développement et de configuration des outils pour faire baisser les temps de chargement d\u0027un site Web.\r\nMais comme tout dév, toute infra, si ces règles sont appliquées manuellement, ça ne tiendra pas dans la durée.\r\nCe qu\u0027il faut, c\u0027est de l\u0027automatisation ! De l\u0027organisation d\u0027abord !\r\n\r\nNon, décidément, la webperf ce n\u0027est pas de la technique !","language":"fr","interests":[421,237,296,353,70,16,356,285,221],"speakers":[234],"nbVotes":5},{"id":316,"title":"Concordion : automatiser les tests d\u0027acceptation","summary":"Comment je suis passé à une stratégie de test intelligible","description":"Concordion est un moteur de spécifications exécutables permettant l\u0027automatisation des tests d\u0027acceptation. Ses deux grandes forces sont l\u0027extrème facilité de mise en œuvre  et surtout le format \"texte libre\" offert pour l\u0027écriture des spécifications. À travers quelques exemples je montrerai comment on peut utiliser Concordion pour mettre en place des tests d\u0027acceptation automatisés efficaces impliquant les équipes de devs, QA et Marketing produit/MOA.","language":"fr","interests":[432,183,431,336,245,65],"speakers":[718],"nbVotes":9}]